app/controllers/home_controller.rb

  def welcome
    @user = User.where(:id => params[:id])
    @product = Product.new
    @products = Product.all
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL
SELECT `products`.* FROM `products`