app/controllers/login_controller.rb

  def create
    @user = User.new
    user = User.authenticate(params[:user][:email], params[:user][:password])
    respond_to do |format|
      if user.present?
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'lavkesh1607@gmail.com' LIMIT 1