app/controllers/product_controller.rb

INSERT INTO `products` (`created_at`, `name`, `price`, `updated_at`) VALUES ('2014-04-01 11:40:06', 'Yogesh', '123', '2014-04-01 11:40:06')
---
  def create
    @product = Product.create(product_params)

SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 ORDER BY `products`.`id` ASC LIMIT 1
---
  def edit
    @products = Product.where(:id => params[:id]).first

SELECT `products`.* FROM `products` WHERE `products`.`id` IS NULL ORDER BY `products`.`id` ASC LIMIT 1
UPDATE `products` SET `name` = 'TV', `price` = '5000', `updated_at` = '2014-04-02 05:57:20' WHERE `products`.`id` = 3
---
  def update
    @products = Product.where(:id => params[:product][:id]).first
    @products.update_attributes(product_params)

SELECT `products`.* FROM `products` WHERE `products`.`id` IS NULL ORDER BY `products`.`id` ASC LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 1
---
  def delete
    @products = Product.where(:id => params[:id]).first
    respond_to do |format|
      if @products.present?
        @products.destroy

SELECT `products`.* FROM `products`
---
  def show
    @products = Product.all