app/controllers/registration_controller.rb

INSERT INTO `users` (`created_at`, `email`, `first_name`, `last_name`, `password_hash`, `password_salt`, `updated_at`) VALUES ('2014-04-01 06:38:06', 'yogesh@gmail.com', 'Yogesh', 'Waghmare', '$2a$10$OM/sCtDXd3ptxjBI9EYYF.OYCYHKrHWY6kyfULac3pdp6AZQNN7VC', '$2a$10$OM/sCtDXd3ptxjBI9EYYF.', '2014-04-01 06:38:06')
UPDATE "users" SET "password_salt" = ?, "password_hash" = ?, "updated_at" = ? WHERE "users"."id" = 4  [["password_salt", "$2a$10$7WLBj0GF0R7LE3WofPVnvO"], ["password_hash", "$2a$10$7WLBj0GF0R7LE3WofPVnvOVY74YvHXUhz3pUJo.6dyB//HThq6n.C"], ["updated_at", Mon, 31 Mar 2014 10:14:49 UTC +00:00]]
---
  def create
    @user = User.create(user_params)
    respond_to do |format|
    if @user.save